Repository: soruva/finqly
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, pt

# emotionPrompt
source: How are you feeling about your finances today?
de: Wie fühlen Sie sich heute in Bezug auf Ihre Finanzen?
es: ¿Cómo te sientes hoy con tus finanzas?
fr: Comment vous sentez-vous aujourd'hui à propos de vos finances ?
pt: Como você está se sentindo em relação às suas finanças hoje?

# startButton
source: Start Now
de: Jetzt starten
es: Iniciar ahora
fr: Commencer maintenant
pt: Começar agora

# diagnosisTitle
source: Diagnosis
de: Diagnose
es: Diagnóstico
fr: Diagnostic
pt: Diagnóstico

# diagnosisQuestion
source: How do you feel about the market right now?
de: Wie fühlen Sie sich momentan in Bezug auf den Markt?
es: ¿Cómo te sientes respecto al mercado en este momento?
fr: Comment vous sentez-vous par rapport au marché en ce moment ?
pt: Como você se sente sobre o mercado neste momento?

# diagnosisButton
source: Run Diagnosis
de: Diagnose ausführen
es: Ejecutar diagnóstico
fr: Lancer le diagnostic
pt: Executar diagnóstico

# optionOptimistic
source: Optimistic
de: Optimistisch
es: Optimista
fr: Optimiste
pt: Otimista

# optionNeutral
source: Neutral
fr: Neutre
pt: Neutro

# optionWorried
source: Worried
de: Besorgt
es: Preocupado
fr: Inquiet
pt: Preocupado

# optionConfused
source: Confused
de: Verwirrt
es: Confundido
fr: Perplexe
pt: Confuso

# optionExcited
source: Excited
de: Aufgeregt
es: Emocionado
fr: Enthousiaste
pt: Animado

# optionCautious
source: Cautious
de: Vorsichtig
es: Cauteloso
fr: Prudent
pt: Cauteloso

# badgeOptimistic
source: You're optimistic about the market!
de: Sie sind optimistisch in Bezug auf den Markt!
es: ¡Tienes una perspectiva optimista del mercado!
fr: Vous êtes optimiste concernant le marché !
pt: Você está otimista em relação ao mercado!

# badgeNeutral
source: You’re feeling neutral today.
de: Sie fühlen sich heute neutral.
es: Hoy te sientes neutral.
fr: Vous vous sentez neutre aujourd'hui.
pt: Você está se sentindo neutro hoje.

# badgeWorried
source: You’re worried about your investments.
de: Sie machen sich Sorgen um Ihre Investitionen.
es: Estás preocupado por tus inversiones.
fr: Vous êtes inquiet pour vos investissements.
pt: Você está preocupado com seus investimentos.

# badgeConfused
source: You feel unsure or confused.
de: Sie fühlen sich unsicher oder verwirrt.
es: Te sientes inseguro o confundido.
fr: Vous vous sentez incertain ou perplexe.
pt: Você está se sentindo inseguro ou confuso.

# badgeExcited
source: You’re feeling energized and ready!
de: Sie sind voller Energie und bereit!
es: ¡Estás lleno de energía y listo!
fr: Vous êtes plein d'énergie et prêt !
pt: Você está cheio de energia e pronto!

# badgeCautious
source: You’re approaching the market with care.
de: Sie gehen den Markt mit Vorsicht an.
es: Estás abordando el mercado con precaución.
fr: Vous abordez le marché avec prudence.
pt: Você está abordando o mercado com cautela.

# investmentTipsTitle
source: Investment Tips
de: Anlagetipps
es: Consejos de inversión
fr: Conseils d'investissement
pt: Dicas de investimento

# investmentTips1
source: Diversify your investments to reduce risk.
de: Diversifizieren Sie Ihre Investitionen, um Risiken zu minimieren.
es: Diversifica tus inversiones para reducir riesgos.
fr: Diversifiez vos investissements pour réduire les risques.
pt: Diversifique seus investimentos para reduzir riscos.

# investmentTips2
source: Don’t let short-term emotions drive long-term decisions.
de: Lassen Sie sich bei langfristigen Entscheidungen nicht von kurzfristigen Emotionen leiten.
es: No dejes que las emociones a corto plazo afecten tus decisiones a largo plazo.
fr: Ne laissez pas les émotions à court terme influencer vos décisions à long terme.
pt: Não deixe emoções de curto prazo influenciarem decisões de longo prazo.

# investmentTips3
source: Understand your risk tolerance before investing.
de: Verstehen Sie Ihre Risikobereitschaft, bevor Sie investieren.
es: Comprende tu tolerancia al riesgo antes de invertir.
fr: Comprenez votre tolérance au risque avant d'investir.
pt: Entenda sua tolerância ao risco antes de investir.

# investmentTips4
source: Stay informed but avoid panic-selling.
de: Bleiben Sie informiert, aber vermeiden Sie Panikverkäufe.
es: Mantente informado, pero evita vender por pánico.
fr: Restez informé, mais évitez de vendre dans la panique.
pt: Mantenha-se informado, mas evite vender em pânico.

# investmentTips5
source: Investing is a long-term journey — not a sprint.
de: Investieren ist eine langfristige Reise – kein Sprint.
es: Invertir es un viaje a largo plazo, no una carrera corta.
fr: Investir est un parcours de longue durée — pas un sprint.
pt: Investir é uma jornada de longo prazo — não uma corrida.

source: Tap to flip
de: Zum Umdrehen tippen
es: Toca para voltear
fr: Touchez pour retourner
pt: Toque para virar

# investmentTipsExplanation1
source: Diversification is the golden rule!
de: Diversifikation ist das oberste Gebot erfolgreicher Anleger!
es: ¡La diversificación es la regla de oro de los inversores exitosos!
fr: La diversification est la règle d’or des investisseurs !
pt: A diversificação é a regra de ouro dos investidores bem-sucedidos!

# investmentTipsExplanation2
source: Stay focused on the long term, not short-term feelings.
de: Lassen Sie sich nicht von kurzfristigen Gefühlen leiten – denken Sie langfristig.
es: No te dejes llevar por las emociones a corto plazo, piensa a largo plazo.
fr: Ne vous laissez pas guider par le court terme — pensez long terme.
pt: Não se deixe levar por sentimentos de curto prazo — pense a longo prazo.

# investmentTipsExplanation3
source: Knowing your risk tolerance reduces mistakes.
de: Wer seine Risikobereitschaft kennt, macht weniger Fehler.
es: Conocer tu tolerancia al riesgo te ayudará a evitar errores.
fr: Connaître votre tolérance au risque réduit les erreurs.
pt: Conhecer sua tolerância ao risco ajuda a evitar erros.

# investmentTipsExplanation4
source: Stay informed. Avoid panic selling!
de: Information ist wichtig – vermeiden Sie dennoch Panikverkäufe!
es: Estar informado es importante. ¡Pero evita vender en pánico!
fr: S’informer est important. Évitez les ventes paniques !
pt: Estar informado é importante. Evite vendas em pânico!

# investmentTipsExplanation5
source: Consistency builds your financial future.
de: Durchhaltevermögen zahlt sich für Ihre Zukunft aus.
es: Invertir a largo plazo es lo que construye el futuro.
fr: La constance construit votre avenir financier.
pt: Consistência constrói o seu futuro financeiro.

# forecastTitle
source: Your Investment Forecast
de: Ihre Investitionsprognose
es: Tu pronóstico de inversión
fr: Vos prévisions d'investissement
pt: Previsão de Investimento

# forecastMessage
source: Based on your mindset and history, you're expected to grow by {percent} this month.
de: Basierend auf Ihrer Einstellung und Ihrem Verlauf wird in diesem Monat ein Wachstum von {percent}% erwartet.
es: Según tu mentalidad e historial, se espera un crecimiento del {percent}% este mes.
fr: Selon votre état d’esprit et votre historique, une croissance de {percent}% est attendue ce mois-ci.
pt: Com base na sua mentalidade e histórico, prevê-se um crescimento de {percent}% neste mês.

# premiumPrompt
source: You're close to unlocking even better insights.
de: Sie sind kurz davor, noch tiefere Einblicke freizuschalten.
es: Estás a punto de desbloquear ideas aún mejores.
fr: Vous êtes sur le point de débloquer des informations encore meilleures.
pt: Você está prestes a desbloquear insights ainda melhores.

# premiumCTA
source: Get Premium Forecast
de: Premium-Prognose erhalten
es: Obtener pronóstico Premium
fr: Obtenir les prévisions Premium
pt: Obter Previsão Premium

source: Language
de: Sprache
es: Idioma
fr: Langue
pt: Idioma

# languageEnglish
source: English
de: Englisch
es: Inglés
fr: Anglais
pt: Inglês

# languageSpanish
source: Español
de: Spanisch
fr: Espagnol
pt: Espanhol

# languagePortuguese
source: Português
de: Portugiesisch
es: Portugués
fr: Portugais

# languageGerman
source: Deutsch
es: Alemán
fr: Allemand
pt: Alemão

# settingsTitle
source: Settings
de: Einstellungen
es: Configuraciones
fr: Paramètres
pt: Configurações

source: Dark Mode
de: Dunkler Modus
es: Modo oscuro
fr: Mode sombre
pt: Modo escuro

source: Light Mode
de: Heller Modus
es: Modo claro
fr: Mode clair
pt: Modo claro

# premiumUnlockTitle
source: Unlock Premium Insights
de: Premium-Einblicke freischalten
es: Desbloquear información Premium
fr: Débloquer les insights Premium
pt: Desbloquear Insights Premium

# premiumUnlockMessage
source: Get access to advanced forecasts, emotional trends, and expert tips.
de: Erhalten Sie Zugang zu erweiterten Prognosen, Emotionstrends und Experten-Tipps.
es: Accede a pronósticos avanzados, tendencias emocionales y consejos de expertos.
fr: Accédez à des prévisions avancées, des tendances émotionnelles et des conseils d’experts.
pt: Acesse previsões avançadas, tendências emocionais e dicas de especialistas.

# premiumUnlockButton
source: Unlock Now
de: Jetzt freischalten
es: Desbloquear ahora
fr: Débloquer maintenant
pt: Desbloquear agora

# premiumDisclaimer
source: You can cancel anytime. No hidden fees.
de: Jederzeit kündbar. Keine versteckten Kosten.
es: Puedes cancelar en cualquier momento. Sin cargos ocultos.
fr: Vous pouvez annuler à tout moment. Aucun frais caché.
pt: Você pode cancelar a qualquer momento. Sem taxas ocultas.

# upgradeToPremium
source: Upgrade to Finqly Plus
de: Upgrade auf Finqly Plus
es: Mejorar a Finqly Plus
fr: Passer à Finqly Plus
pt: Atualizar para o Finqly Plus

# unlockInsights
source: 💡 Unlock deeper insights
de: 💡 Tiefere Einblicke freischalten
es: 💡 Desbloquea conocimientos más profundos
fr: 💡 Débloquez des insights plus profonds
pt: 💡 Desbloqueie insights mais profundos

# premiumFeature1
source: Advanced forecasts with emotion data.
de: Erweiterte Prognosen mit Emotionsdaten.
es: Pronósticos avanzados con datos emocionales.
fr: Prévisions avancées basées sur des données émotionnelles.
pt: Previsões avançadas com base em dados emocionais.

# premiumFeature2
source: Track emotional trends over time.
de: Emotionstrends im Zeitverlauf verfolgen.
es: Sigue las tendencias emocionales a lo largo del tiempo.
fr: Suivez l’évolution de vos émotions dans le temps.
pt: Acompanhe tendências emocionais ao longo do tempo.

# premiumFeature3
source: Get expert investing tips.
de: Experten-Tipps zur Geldanlage erhalten.
es: Obtén consejos de inversión de expertos.
fr: Recevez des conseils d’experts en investissement.
pt: Receba dicas de especialistas em investimentos.

# premiumUnlockSuccess
source: Premium unlocked successfully!
de: Premium erfolgreich freigeschaltet!
es: ¡Premium desbloqueado con éxito!
fr: Premium débloqué avec succès !
pt: Premium desbloqueado com sucesso!

# premiumUnlockError
source: Something went wrong. Please try again.
de: Ein Fehler ist aufgetreten. Bitte versuchen Sie es erneut.
es: Algo salió mal. Por favor, inténtalo de nuevo.
fr: Une erreur s’est produite. Veuillez réessayer.
pt: Algo deu errado. Tente novamente.

# emotionHistoryTitle
source: Emotion History
de: Emotionsverlauf
es: Historial emocional
fr: Historique des émotions
pt: Histórico emocional

# emotionHistoryEmpty
source: No history found.
de: Keine Einträge gefunden.
es: No se encontró historial.
fr: Aucun historique trouvé.
pt: Nenhum histórico encontrado.

# educationTitle
source: Financial Education
de: Finanzbildung
es: Educación financiera
fr: Éducation financière
pt: Educação financeira

source: Other
de: Sonstiges
es: Otros
fr: Autres
pt: Outros

# trendForecastTitle
source: Emotion Trend Chart
de: Emotionstrend-Diagramm
es: Gráfico de tendencia emocional
fr: Graphique de tendance émotionnelle
pt: Gráfico de tendência emocional

# premiumFeatureExplain
source: Premium unlocks all trend, chart, and pro tips features.
de: Premium schaltet alle Trend-, Diagramm- und Pro-Tipps-Funktionen frei.
es: Premium desbloquea todas las funciones de tendencias, gráficos y consejos pro.
fr: Premium débloque toutes les fonctions de tendances, graphiques et conseils pro.
pt: O Premium desbloqueia todos os gráficos de tendências e dicas exclusivas.

# noTrendData
source: No trend data available.
de: Keine Trenddaten verfügbar.
es: No hay datos de tendencia disponibles.
fr: Aucune donnée de tendance disponible.
pt: Nenhum dado de tendência disponível.

# trendForecastDescription
source: Your recent emotional trend is visualized below.
de: Ihr jüngster Emotionstrend wird unten visualisiert.
es: Tu tendencia emocional reciente se visualiza a continuación.
fr: Votre tendance émotionnelle récente est visualisée ci-dessous.
pt: Sua tendência emocional recente está visualizada abaixo.

# languageFrench
source: Français
de: Französisch
es: Francés
pt: Francês
